
squares = [x ** 2 for x in range(10)]
print(squares)
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]
odds = [x for x in range(10) if x % 2 != 0]
print(odds)
# [1, 3, 5, 7, 9]
#если в условии нужен else, то всё условие пишется до for:
opa=[x ** 2 if x % 2 == 0 else x ** 3 for x in range(10)]
print(opa)
# [0, 1, 4, 27, 16, 125, 36, 343, 64, 729]

second = [(x, y) for x in range(1, 5) for y in range(5, 1, -1) if x != y]
print(second)
#[(1, 5), (1, 4), (1, 3), (1, 2), (2, 5), (2, 4), (2, 3), (3, 5), (3, 4), (3, 2), (4, 5), (4, 3), (4, 2)]

#Отличный пример из документации (раскрытие списка списков), усложним его:
vec = [[[1, 2, 3], [4, 5, 6], [7, 8, 9]], [[10, 11, 12], [13, 14, 15], [16, 17, 18]]]
rezz=[digit for lst in vec for elem in lst for digit in elem]
print(rezz)
# [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18]

#Подобным образом с помощью генераторов списков мы можем создать словарь:
rez2=dict([(key, value) for (key, value) in zip([1, 2, 3], ['a', 'b', 'c'])])
print(rez2)
# {1: 'a', 2: 'b', 3: 'c'}

#в python есть и генераторы словарей, записываются так же, 
#как и генераторы списков, только в фигурных скобках { ... }:
rez3={key: value for key, value in zip([1, 2, 3], ['a', 'b', 'c'])}
print(rez3)
# {1: 'a', 2: 'b', 3: 'c'}